In [1]:
pip install numpy

Note: you may need to restart the kernel to use updated packages.

'C:\Users\Shubham' is not recognized as an internal or external command,
operable program or batch file.

In [3]:
import pandas as pd
import numpy as np
Dict = {"Names":["Shubham", "Rajat", "Nikhil"],
       "Marks": [54,75,26],
       "City": ["Pune", "Karanja", "Nagpur"]}
df = pd.DataFrame(Dict)
df.to_csv("friends.csv")

In [4]:
df

     Names  Marks     City
0  Shubham     54     Pune
1    Rajat     75  Karanja
2   Nikhil     26   Nagpur

Row = index, axis 0
column = col, axis 1
to_csv method is use to add data into csv file

In [5]:
df.head(2) # to print first rows
df.tail(2) # to print last rows
df.describe() # to print all details

           Marks
count   3.000000
mean   51.666667
std    24.583192
min    26.000000
25%    40.000000
50%    54.000000
75%    64.500000
max    75.000000

In [6]:
df = pd.read_csv("input.csv")

In [10]:
ser = pd.Series(np.random.rand(34)) #series is nothing but the one column

In [12]:
ser.head()

0    0.119692
1    0.860318
2    0.410135
3    0.423105
4    0.890257
dtype: float64

In [111]:
new_df = pd.DataFrame(np.random.rand(334, 5), index=(np.arange(334)))

In [19]:
new_df.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [20]:
new_df.index #it gives all rows length"

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [21]:
new_df.columns #it gives total no of columns

RangeIndex(start=0, stop=5, step=1)

In [22]:
new_df.to_numpy()#convert all the data into numpy array

array([[0.75665359, 0.75743142, 0.21477207, 0.16874879, 0.32030961],
       [0.00318879, 0.21722144, 0.06278033, 0.28088272, 0.82739884],
       [0.25809485, 0.89203393, 0.2071115 , 0.89005196, 0.36251435],
       ...,
       [0.49016107, 0.61833141, 0.47296513, 0.75747172, 0.11074082],
       [0.57047001, 0.14700177, 0.01773403, 0.30639055, 0.10666216],
       [0.78699587, 0.22652415, 0.83934292, 0.08703762, 0.30773553]])

In [23]:
new_df.T #to transform rows into col

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.756654,0.003189,0.258095,0.201412,0.894833,0.836740,0.088806,0.089080,0.286659,0.747412,...,0.693530,0.702970,0.020162,0.555567,0.036303,0.068374,0.305525,0.490161,0.570470,0.786996
1,0.757431,0.217221,0.892034,0.438722,0.830852,0.851486,0.362236,0.113397,0.013571,0.073253,...,0.756272,0.504777,0.546004,0.898748,0.289584,0.300746,0.644933,0.618331,0.147002,0.226524
2,0.214772,0.062780,0.207111,0.768941,0.356151,0.878648,0.165180,0.044839,0.822745,0.952136,...,0.947154,0.745874,0.677787,0.710686,0.501082,0.815748,0.843384,0.472965,0.017734,0.839343
3,0.168749,0.280883,0.890052,0.618316,0.109172,0.831672,0.786769,0.812873,0.347460,0.157494,...,0.380904,0.002534,0.344686,0.446186,0.695353,0.796935,0.831799,0.757472,0.306391,0.087038
4,0.320310,0.827399,0.362514,0.544565,0.820589,0.994759,0.674560,0.301416,0.258320,0.726390,...,0.014985,0.094506,0.711748,0.925806,0.442434,0.900735,0.099669,0.110741,0.106662,0.307736

In [24]:
new_df.sort_index(axis=0, ascending=False) #to sort the table in assending or descending order

            0         1         2         3         4
333  0.786996  0.226524  0.839343  0.087038  0.307736
332  0.570470  0.147002  0.017734  0.306391  0.106662
331  0.490161  0.618331  0.472965  0.757472  0.110741
330  0.305525  0.644933  0.843384  0.831799  0.099669
329  0.068374  0.300746  0.815748  0.796935  0.900735
..        ...       ...       ...       ...       ...
4    0.894833  0.830852  0.356151  0.109172  0.820589
3    0.201412  0.438722  0.768941  0.618316  0.544565
2    0.258095  0.892034  0.207111  0.890052  0.362514
1    0.003189  0.217221  0.062780  0.280883  0.827399
0    0.756654  0.757431  0.214772  0.168749  0.320310

[334 rows x 5 columns]

In [113]:
new_df.columns = ['A', 'B', 'C', 'D', 'E']

### Loc

In [69]:
new_df.loc[0,1] = 1111 #here 0 is row value and 1 is col value

In [70]:
new_df.head(2)

          A            B         C         D         E       1
0  0.756654  1111.000000  0.214772  0.168749  0.320310  1111.0
1  0.003189     0.217221  0.062780  0.280883  0.827399     NaN

In [77]:
new_df.loc[0,5] = 211 #if col/row is not present then it will create new col/row and assign value to it
# new_df.loc[334,5] = 211

In [78]:
new_df.head(2)
# new_df.tail(2)

            A         B         C         D         E   1      5
333  0.786996  0.226524  0.839343  0.087038  0.307736 NaN    NaN
334       NaN       NaN       NaN       NaN       NaN NaN  211.0

In [86]:
new_df=new_df.drop(1, axis=1) #this will drop 5th column because we are passing axis as 1

In [79]:
new_df=new_df.drop(334, axis=0)

In [81]:
new_df.loc[[0,4],['C']]#to get set of columns then we can use like this, if we want to set then use new_df=...

          C
0  0.214772
4  0.356151

In [90]:
new_df.loc[[2,3], :]
# new_df.loc[:, ['B']]
#to get all rows first list is replace by ":" & if we want to get all columns then replace second list with ":"

          A         B         C         D         E
2  0.258095  0.892034  0.207111  0.890052  0.362514
3  0.201412  0.438722  0.768941  0.618316  0.544565

In [93]:
new_df.loc[(new_df['A']>0.3)] #it gives only those rows which fulfil the condition

            A            B         C         D         E
0    0.756654  1111.000000  0.214772  0.168749  0.320310
4    0.894833     0.830852  0.356151  0.109172  0.820589
5    0.836740     0.851486  0.878648  0.831672  0.994759
9    0.747412     0.073253  0.952136  0.157494  0.726390
15   0.792435     0.397922  0.056664  0.268877  0.958565
..        ...          ...       ...       ...       ...
327  0.555567     0.898748  0.710686  0.446186  0.925806
330  0.305525     0.644933  0.843384  0.831799  0.099669
331  0.490161     0.618331  0.472965  0.757472  0.110741
332  0.570470     0.147002  0.017734  0.306391  0.106662
333  0.786996     0.226524  0.839343  0.087038  0.307736

[212 rows x 5 columns]

### iloc
iloc is basically travel from start point to end and then return the output
for iloc it is not necessary that to give proper name of index, we can use 0,1,2... for specifying the targeted value

In [95]:
new_df.iloc[0,3] #it start searching on row 1 and travel till 3rd column and give the result

0.16874879318268088

In [102]:
new_df.iloc[[1,3], [3,4]] #from row 1 and 3 it gives value from D and E column
# new_df.iloc[[1,3], [3]]

          D         E
1  0.280883  0.827399
3  0.618316  0.544565

In [114]:
new_df.drop(['A', 'C'], axis=1) #it will drop that perticular row/col depends on index and axis, bydefault axis is 0. It will not change original dataframe

            B         D         E
0    0.211015  0.690520  0.449075
1    0.976452  0.333950  0.951173
2    0.872793  0.851087  0.077869
3    0.446820  0.251737  0.375365
4    0.955755  0.052895  0.744578
..        ...       ...       ...
329  0.168412  0.412179  0.334893
330  0.890752  0.455591  0.896057
331  0.849789  0.549593  0.751071
332  0.558706  0.213923  0.650642
333  0.714463  0.230451  0.640966

[334 rows x 3 columns]

In [115]:
# If we want to remove that data from original dataframe then we have to use inplace-True
new_df.drop(['C'], inplace=True, axis=1)
new_df.head()

          A         B         D         E
0  0.218642  0.211015  0.690520  0.449075
1  0.944102  0.976452  0.333950  0.951173
2  0.349023  0.872793  0.851087  0.077869
3  0.322595  0.446820  0.251737  0.375365
4  0.467899  0.955755  0.052895  0.744578

In [116]:
new_df.drop([1,3], inplace=True, axis=0) #this will drop the 1st and 3rd index row but it will disturb the index, lets see

In [117]:
new_df.head()

          A         B         D         E
0  0.218642  0.211015  0.690520  0.449075
2  0.349023  0.872793  0.851087  0.077869
4  0.467899  0.955755  0.052895  0.744578
5  0.161236  0.730156  0.414860  0.956136
6  0.278150  0.883123  0.692319  0.710165

In [119]:
new_df.reset_index()#to reset the index use this function

     index         A         B         D         E
0        0  0.218642  0.211015  0.690520  0.449075
1        2  0.349023  0.872793  0.851087  0.077869
2        4  0.467899  0.955755  0.052895  0.744578
3        5  0.161236  0.730156  0.414860  0.956136
4        6  0.278150  0.883123  0.692319  0.710165
..     ...       ...       ...       ...       ...
327    329  0.871453  0.168412  0.412179  0.334893
328    330  0.274947  0.890752  0.455591  0.896057
329    331  0.016014  0.849789  0.549593  0.751071
330    332  0.070322  0.558706  0.213923  0.650642
331    333  0.996487  0.714463  0.230451  0.640966

[332 rows x 5 columns]

In [120]:
new_df.reset_index(drop=True)# To remove this index col which is creating use drop = True in same above function

            A         B         D         E
0    0.218642  0.211015  0.690520  0.449075
1    0.349023  0.872793  0.851087  0.077869
2    0.467899  0.955755  0.052895  0.744578
3    0.161236  0.730156  0.414860  0.956136
4    0.278150  0.883123  0.692319  0.710165
..        ...       ...       ...       ...
327  0.871453  0.168412  0.412179  0.334893
328  0.274947  0.890752  0.455591  0.896057
329  0.016014  0.849789  0.549593  0.751071
330  0.070322  0.558706  0.213923  0.650642
331  0.996487  0.714463  0.230451  0.640966

[332 rows x 4 columns]

In [125]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [126]:
df

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [127]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [130]:
df.drop_duplicates(subset='name')

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [132]:
df.shape

(3, 3)

In [133]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [138]:
df['toy'].value_counts(dropna=False)

Batmobile    1
Bullwhip     1
NaN          1
Name: toy, dtype: int64

# Exercise

Create dataframe which contain intigers with two rows and three columns
use below methods
df.describe()
df.mean()
df.corr()
df.count()
df.mean()
df.max()
df.median()
df.std()

In [172]:
import pandas as pd
int_df = pd.DataFrame({1:[1,2,3],
                      2: [20,40,60]})

In [173]:
int_df

   1   2
0  1  20
1  2  40
2  3  60

In [174]:
int_df.describe()

         1     2
count  3.0   3.0
mean   2.0  40.0
std    1.0  20.0
min    1.0  20.0
25%    1.5  30.0
50%    2.0  40.0
75%    2.5  50.0
max    3.0  60.0

In [175]:
int_df.median()

1     2.0
2    40.0
dtype: float64

In [177]:
int_df.corr() #corr() is used to find the pairwise correlation of all columns in the dataframe.
#Any na values are automatically excluded. For any non-numeric data type columns in the dataframe it is ignored.

     1    2
1  1.0  1.0
2  1.0  1.0

In [178]:
int_df.count()

1    3
2    3
dtype: int64

In [179]:
int_df.mean()

1     2.0
2    40.0
dtype: float64

In [180]:
int_df.max()

1     3
2    60
dtype: int64

In [181]:
int_df.median()

1     2.0
2    40.0
dtype: float64

In [182]:
int_df.std()

1     1.0
2    20.0
dtype: float64